import { defineConfig } from 'vitepress'

export default defineConfig({
  title: '大粽子',
  description: '大粽子',

  ignoreDeadLinks: true,

  srcExclude: [
    '06_API文档/04_用户接口.md',
  ],

  head: [
    ['meta', { name: 'viewport', content: 'width=device-width, initial-scale=1.0' }],
    ['link', { rel: 'icon', href: '/logo.svg' }]
  ],

  themeConfig: {
    logo: '/logo.svg',

    nav: [
      { text: '首页', link: '/' },
      { text: '初步了解', link: '/01_初步了解/' },
      { text: '系统安装', link: '/02_系统安装/' },
      { text: '使用手册', link: '/03_使用手册/' },
    ],

    sidebar: {
      '/01_初步了解/': [
        {
          text: '初步了解',
          items: [
            { text: '快速了解', link: '/01_初步了解/01_快速了解' },
            { text: '本地运行', link: '/01_初步了解/02_本地运行' },
            { text: '服务购买和搭建', link: '/01_初步了解/03_服务购买和搭建' },
            { text: '域名购买和解析', link: '/01_初步了解/04_域名购买和解析' },
            { text: '宝塔安装高手可忽略', link: '/01_初步了解/05_宝塔安装高手可忽略' },
            { text: '服务器运行环境', link: '/01_初步了解/06_服务器运行环境' },
            { text: '创建站点并配置', link: '/01_初步了解/07_创建站点并配置' },
            { text: '代码-Java项目打包', link: '/01_初步了解/08_代码-Java项目打包' },
            { text: '代码-管理端打包', link: '/01_初步了解/09_代码-管理端打包' },
            { text: '代码H5打包', link: '/01_初步了解/10_代码H5打包' },
            { text: 'App-基础配置', link: '/01_初步了解/11_App-基础配置' },
            { text: 'App-开发调试', link: '/01_初步了解/12_App-开发调试' },
            { text: 'App-打包配置', link: '/01_初步了解/13_App-打包配置' },
            { text: 'App-打包上线', link: '/01_初步了解/14_App-打包上线' },
            { text: 'App-隐私政策', link: '/01_初步了解/15_App-隐私政策' },
            { text: '微信小程序打包', link: '/01_初步了解/16_微信小程序打包' },
            { text: 'PC商城部署', link: '/01_初步了解/17_PC商城部署' }
          ]
        }
      ],
      '/02_系统安装/': [
        {
          text: '系统安装',
          items: [
            { text: '云存储配置指南', link: '/02_系统安装/02_云存储配置指南' },
            { text: '微信公众号支付配置', link: '/02_系统安装/03_微信公众号支付配置指南' },
            { text: '微信小程序配置指南', link: '/02_系统安装/04_微信小程序配置指南' },
            { text: '微信小程序支付配置', link: '/02_系统安装/05_微信小程序支付配置' },
            { text: '支付宝开通与支付配置', link: '/02_系统安装/06_支付宝开通和支付' },
            { text: 'wxJava框架配置', link: '/02_系统安装/07_wxJava正确配置' }
          ]
        }
      ],
      '/03_使用手册/': [
        {
          text: '使用手册',
          items: [
            { text: '圈层管理完全指南', link: '/03_使用手册/01_圈层介绍' },
            { text: '用户等级管理', link: '/03_使用手册/02_用户等级管理' },
            { text: '用户管理', link: '/03_使用手册/03_用户管理' },
            { text: '商户管理', link: '/03_使用手册/04_商户管理' },
            { text: '商品管理', link: '/03_使用手册/05_商品管理' },
            { text: '付费会员管理', link: '/03_使用手册/06_付费会员管理' },
            { text: '微信小程序直播', link: '/03_使用手册/07_小程序直播' },
            { text: '订单管理', link: '/03_使用手册/08_订单管理' },
            { text: '订单支付说明', link: '/03_使用手册/09_订单支付说明' },
            { text: '退款管理', link: '/03_使用手册/10_退款管理' },
            { text: '优惠券活动', link: '/03_使用手册/11_优惠券活动' },
            { text: '优惠券列表管理', link: '/03_使用手册/12_优惠券列表' },
            { text: '优惠券领取记录', link: '/03_使用手册/13_优惠券领取记录' },
            { text: '用户有礼', link: '/03_使用手册/14_用户有礼' },
            { text: '秒杀活动说明', link: '/03_使用手册/15_秒杀活动说明' },
            { text: '秒杀活动管理', link: '/03_使用手册/16_秒杀活动管理' },
            { text: '秒杀配置', link: '/03_使用手册/17_秒杀配置' },
            { text: '秒杀商品', link: '/03_使用手册/18_秒杀商品' },
            { text: '拼团活动说明', link: '/03_使用手册/19_拼团活动说明' },
            { text: '拼团活动管理', link: '/03_使用手册/20_拼团活动管理' },
            { text: '拼团记录', link: '/03_使用手册/21_拼团记录' },
            { text: '签到活动说明', link: '/03_使用手册/22_签到活动说明' },
            { text: '签到配置', link: '/03_使用手册/23_签到配置' },
            { text: '签到记录', link: '/03_使用手册/24_签到记录' },
            { text: '积分商城说明', link: '/03_使用手册/25_积分商城说明' },
            { text: '积分商品管理', link: '/03_使用手册/26_积分商品管理' },
            { text: '积分配置', link: '/03_使用手册/27_积分配置' },
            { text: '积分订单', link: '/03_使用手册/28_积分订单' },
            { text: '平台积分管理', link: '/03_使用手册/29_平台积分管理' },
            { text: '种草社区', link: '/03_使用手册/30_种草社区' },
            { text: '种草社区管理', link: '/03_使用手册/31_种草社区管理' },
            { text: '文章管理', link: '/03_使用手册/32_文章管理' },
            { text: '氛围图与活动边框', link: '/03_使用手册/33_氛围图与活动边框' },
            { text: '分销管理', link: '/03_使用手册/34_分销管理' },
            { text: '页面装修', link: '/03_使用手册/35_页面装修' },
            { text: '装修工具箱', link: '/03_使用手册/36_装修工具箱' },
            { text: '结算管理', link: '/03_使用手册/37_结算管理' },
            { text: '财务流水', link: '/03_使用手册/38_财务流水' },
            { text: '平台设置', link: '/03_使用手册/39_平台设置' },
            { text: '权限管理', link: '/03_使用手册/40_权限管理' },
            { text: 'PC商城设置', link: '/03_使用手册/41_PC商城设置' },
            { text: '公众号设置', link: '/03_使用手册/42_公众号设置' },
            { text: '小程序应用设置', link: '/03_使用手册/43_小程序应用设置' },
            { text: '商户端商品管理', link: '/03_使用手册/44_商户端商品管理' },
            { text: '商户端分类与规格', link: '/03_使用手册/45_商户端分类与规格' },
            { text: '商户端评价与保障', link: '/03_使用手册/46_商户端评价与保障' },
            { text: '商户端预约服务', link: '/03_使用手册/47_商户端预约服务' },
            { text: '商户端订单与退款', link: '/03_使用手册/48_商户端订单与退款' },
            { text: '商户端工单管理', link: '/03_使用手册/49_商户端工单管理' },
            { text: '商户端店铺装修', link: '/03_使用手册/50_商户端店铺装修' },
            { text: '商户端优惠券管理', link: '/03_使用手册/51_商户端优惠券管理' },
            { text: '商户端拼团活动', link: '/03_使用手册/52_商户端拼团活动' },
          ]
        }
      ],
    },

    socialLinks: [
      { icon: 'github', link: 'https://github.com' }
    ],

    footer: {
      message: '大粽子',
      copyright: ''
    },

    search: {
      provider: 'local'
    },

    docFooter: {
      prev: '上一页',
      next: '下一页'
    },

    outline: {
      label: '页面导航'
    }
  },

  markdown: {
    lineNumbers: true,
    theme: 'github-dark',
    breaks: true
  }
})
